Repository: MmohithSai/TripSync-Supabase
Catalog: lib/l10n/app_*.arb
Languages: ml

# appTitle
source: Location Tracker
ml: ലൊക്കേഷൻ ട്രാക്കർ

source: Map
ml: മാപ്പ്

source: History
ml: ചരിത്രം

source: Settings
ml: ക്രമീകരണങ്ങൾ

source: Location service enabled
ml: ലൊക്കേഷൻ സേവനം പ്രവർത്തിക്കുന്നു

source: Request location permission
ml: ലൊക്കേഷൻ അനുമതി അഭ്യർത്ഥിക്കുക

source: Granted
ml: നൽകി

source: Not granted
ml: നൽകിയിട്ടില്ല

source: Sync now
ml: ഇപ്പോൾ സിങ്ക് ചെയ്യുക

# flushLocallyQueuedLocations
source: Flush locally queued locations to cloud
ml: പ്രാദേശിക ക്യൂവിലുള്ള ലൊക്കേഷനുകൾ ക്ലൗഡിലേക്ക് അയയ്ക്കുക

source: Sync attempted
ml: സിങ്ക് ശ്രമിച്ചു

source: Sign out
ml: സൈൻ ഔട്ട്

source: Not signed in
ml: സൈൻ ഇൻ ചെയ്തിട്ടില്ല

source: No trips yet
ml: ഇതുവരെ യാത്രകളില്ല

source: Trip
ml: യാത്ര

source: Mode
ml: മോഡ്

source: Distance
ml: ദൂരം

source: Time
ml: സമയം

source: saved
ml: സേവ് ചെയ്തു

source: Edit trip
ml: യാത്ര എഡിറ്റ് ചെയ്യുക

source: Environmental Impact
ml: പരിസ്ഥിതി പ്രഭാവം

# co2Saved
source: CO₂ Saved
ml: CO₂ സേവ് ചെയ്തു

source: Cost
ml: ചെലവ്

source: Impact
ml: പ്രഭാവം

source: Origin region
ml: ഉത്ഭവ പ്രദേശം

source: Destination region
ml: ലക്ഷ്യസ്ഥാന പ്രദേശം

source: Trip number
ml: യാത്ര നമ്പർ

source: Chain ID
ml: ചെയിൻ ID

source: Passengers
ml: യാത്രക്കാർ

source: Adults
ml: പ്രായമായവർ

source: Children
ml: കുട്ടികൾ

source: Seniors
ml: മുതിർന്നവർ

# companionRelationship
source: Companion relationship (optional)
ml: കൂട്ടുകാരനുമായുള്ള ബന്ധം (ഓപ്ഷണൽ)

source: Cancel
ml: റദ്ദാക്കുക

source: Save
ml: സേവ് ചെയ്യുക

source: ongoing
ml: തുടരുന്നു

source: Unknown
ml: അജ്ഞാതം

source: Walk
ml: നടത്തം

source: Bicycle
ml: സൈക്കിൾ

source: Car
ml: കാർ

source: Bus
ml: ബസ്

source: Train
ml: ട്രെയിൻ

source: Metro
ml: മെട്രോ

source: Scooter
ml: സ്കൂട്ടർ

source: Work
ml: ജോലി

source: School
ml: സ്കൂൾ

source: Shopping
ml: ഷോപ്പിംഗ്

source: Leisure
ml: വിശ്രമം

source: Healthcare
ml: ആരോഗ്യസംരക്ഷണം

source: Other
ml: മറ്റുള്ളവ

source: Language
ml: ഭാഷ

source: Privacy Policy
ml: സ്വകാര്യതാ നയം

source: Data Retention
ml: ഡാറ്റാ നിലനിർത്തൽ

source: Battery Optimization
ml: ബാറ്ററി ഒപ്റ്റിമൈസേഷൻ

source: Weekly Summary
ml: ആഴ്ചയിലെ സംഗ്രഹം

source: Total Distance
ml: മൊത്തം ദൂരം

source: Total Trips
ml: മൊത്തം യാത്രകൾ

# co2SavedThisWeek
source: CO₂ Saved This Week
ml: ഈ ആഴ്ച CO₂ സേവ് ചെയ്തു

source: Top Mode
ml: മുകളിലെ മോഡ്

source: Batch Edit
ml: ബാച്ച് എഡിറ്റ്

source: Select Trips
ml: യാത്രകൾ തിരഞ്ഞെടുക്കുക

source: Update Selected
ml: തിരഞ്ഞെടുത്തവ അപ്ഡേറ്റ് ചെയ്യുക

source: Select All
ml: എല്ലാം തിരഞ്ഞെടുക്കുക

source: Deselect All
ml: എല്ലാം അൺസെലക്റ്റ് ചെയ്യുക

# batteryOptimizationWarning
source: Battery optimization is restricting background location tracking. Please disable battery optimization for this app to ensure accurate trip detection.
ml: ബാറ്ററി ഒപ്റ്റിമൈസേഷൻ ബാക്ക്‌ഗ്രൗണ്ട് ലൊക്കേഷൻ ട്രാക്കിംഗ് പരിമിതപ്പെടുത്തുന്നു. കൃത്യമായ യാത്രാ കണ്ടെത്തലിനായി ഈ ആപ്പിനുള്ള ബാറ്ററി ഒപ്റ്റിമൈസേഷൻ പ്രവർത്തനരഹിതമാക്കുക.

source: Open Settings
ml: ക്രമീകരണങ്ങൾ തുറക്കുക

source: Dismiss
ml: ഒഴിവാക്കുക
